turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c/atdf/ATSAM4C16C_1.atdf
      <value-group caption="" name="SUPC_WUIR__WKUPT15">
        <value caption="A low level for a period defined by WKUPDBC in SUPC_WUMR on the corresponding wake-up input forces a system wake-up." name="LOW" value="0"/>
        <value caption="A high level for a period defined by WKUPDBC in SUPC_WUMR on the corresponding wake-up input forces a system wake-up." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__FWUPS">
        <value caption="No wake-up due to the assertion of the FWUP pin has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to the assertion of the FWUP pin has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPS">
        <value caption="No wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMWS">
        <value caption="No wake-up due to a supply monitor detection has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one wake-up due to a supply monitor detection has occurred since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__BODRSTS">
        <value caption="No core brownout rising edge event has been detected since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one brownout output rising edge event has been detected since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMRSTS">
        <value caption="No supply monitor detection has generated a system reset since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection has generated a system reset since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMS">
        <value caption="No supply monitor detection since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one supply monitor detection since the last read of SUPC_SR." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__SMOS">
        <value caption="The supply monitor detected VDDIO higher than its threshold at its last measurement." name="HIGH" value="0"/>
        <value caption="The supply monitor detected VDDIO lower than its threshold at its last measurement." name="LOW" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__OSCSEL">
        <value caption="The slow clock, SLCK, is generated by the embedded 32 kHz RC oscillator." name="RC" value="0"/>
        <value caption="The slow clock, SLCK, is generated by the 32 kHz crystal oscillator." name="CRYST" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__LCDS">
        <value caption="LCD controller is disabled." name="DISABLED" value="0"/>
        <value caption="LCD controller is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__LPDBCS2">
        <value caption="No tamper detection or wake-up due to the assertion of the WKUP14/TMP2 pin has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one tamper detection and wake-up (if enabled by WKUPEN14) due to the assertion of the WKUP14/TMP2 pin has occurred since the last read of SUPC_SR. The SUPC interrupt line is asserted while LPDBCS2 is 1." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__LPDBCS3">
        <value caption="No tamper detection or wake-up due to the assertion of the WKUP15/TMP3 pin has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one tamper detection and wake-up (if enabled by WKUPEN15) due to the assertion of the WKUP15/TMP3 pin has occurred since the last read of SUPC_SR. The SUPC interrupt line is asserted while LPDBCS2 is 1." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__FWUPIS">
        <value caption="FWUP input is tied low." name="LOW" value="0"/>
        <value caption="FWUP input is tied high." name="HIGH" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__LPDBCS0">
        <value caption="No tamper detection or wake-up due to the assertion of the WKUP0/TMP0 pin has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one tamper detection and wake-up (if enabled by WKUPEN0) due to the assertion of the WKUP0/TMP0 pin has occurred since the last read of SUPC_SR. The SUPC interrupt line is asserted while LPDBCS0 is 1." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__LPDBCS1">
        <value caption="No tamper detection or wake-up due to the assertion of the WKUP10 pin has occurred since the last read of SUPC_SR." name="NO" value="0"/>
        <value caption="At least one tamper detection and wake-up (if enabled by WKUPEN10) due to the assertion of the WKUP10/TMP1 pin has occurred since the last read of SUPC_SR. The SUPC interrupt line is asserted while LPDBCS1 is 1." name="PRESENT" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__BUPPORS">
        <value caption="Backup POR is disabled." name="BUPPOR_DISABLED" value="0"/>
        <value caption="Backup POR is enabled." name="BUPPOR_ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS0">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS1">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS2">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SR__WKUPIS3">
        <value caption="The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event." name="DIS" value="0"/>
        <value caption="The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR." name="EN" value="1"/>
      </value-group>
